Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོའི་བཙུན་མོ་དཔལ་གྱི་བཞིན་ཡོངས་སུ་རྒྱས་པ་ཞེས་བྱ་བ་དེ་ལས་བུ་མོ་པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་ཡན་ལག་ཐམས་ཅད་ཚང་བ།
en: “Saṃpūrṇa­śrīvakrā, the king’s queen, had the cakravartin’s daughter named Padma­bhadrābhirāma­netra­śrī­candrā. She had a completely perfect body.

source: གཟུགས་མཛེས་ཤིང་སྡུག་པ། བལྟ་ན་ཡིད་དུ་འོང་བ།
en: She was beautiful, attractive, and lovely to look at.

source: འཇིག་རྟེན་ཐམས་ཅད་གྱིས་བལྟ་ན་མི་ངོམས་པ་བྱུང་བར་གྱུར་ཏེ།
en: The whole world never had enough of looking at her.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལ་བལྟ་ན་སུ་ཡང་ངོམས་པར་མི་འགྱུར་བ་དེ་བཞིན་དུ་འཁོར་ལོས་སྒྱུར་བའི་བུ་མོ་པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་དེ་ལ་བལྟ་བས་ཀྱང་སུ་ཡང་ངོམས་པར་མི་འགྱུར་ཏེ། ཤེས་རབ་ཀྱིས་ཡོངས་སུ་ངོམས་པར་འགྱུར་བ་ནི་མ་གཏོགས་སོ།
en: For example, noble one, just as no one was ever satisfied that they had seen enough of the cakravartin, in the same way no one was ever satisfied that they had seen enough of the cakravartin’s daughter Padma­bhadrābhirāma­netra­śrī, except for those who had gained the satisfaction of wisdom.

source: །དེའི་ཚེ་དེའི་དུས་ན། སེམས་ཅན་རྣམས་ཀྱང་ཚེ་དཔག་ཏུ་མེད་པར་གྱུར་ཏེ།
en: “At that time, in that time, beings had an immeasurable lifespan.

source: ཚེ་ལ་གཅིག་ཏུ་ངེས་པ་མེད་པས་བར་མ་དོར་འཆི་བ་ནི་ཡོད་དོ། །དེའི་དུས་ན་སེམས་ཅན་རྣམས་ཀྱི་དབྱིབས་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དབྱངས་སྣ་ཚོགས་དང་། མིང་སྣ་ཚོགས་དང་། རིགས་སྣ་ཚོགས་དང་། ཚེའི་ཚད་སྣ་ཚོགས་དང་། ཆུ་ཞེང་རྣམ་པ་ཐ་དད་པ་དང་། མོས་པ་དང་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མཐུ་རྣམ་པ་ཐ་དད་པ་དང་། ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བ་རྣམ་པ་ཐ་དད་པ་དང་། ཡངས་པ་དང་དམའ་བ་ལ་མོས་པ་སྣ་ཚོགས་ཀྱང་ཡོད་པར་གྱུར་ཏེ།
en: There was no definite lifespan, so death occurred during it. At that time, beings had various shapes, various colors, various voices, various names, various families, various lifespans, and different sizes; different aspirations, strengths, diligences, and powers; different beautiful and ugly appearances; and various higher and lower aspirations.

source: དེ་ལ་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཁ་དོག་བཟང་བ་དང་། ཡངས་པ་ལ་མོས་པ་དང་། ཡན་ལག་ཚང་བ་དང་། བལྟ་ན་སྡུག་ཅིང་ཡིད་དུ་འོང་བར་གྱུར་པ་དེ་དག་ནི་འདི་སྐད་ཅེས་འཛེར་ཏེ།
en: “Those beings who had good color, high aspirations, and perfect bodies and were beautiful and lovely to look at said, ‘Oh!

source: ཀྱེ་མི་དག་ང་ནི་ཁྱེད་བས་ཁ་དོག་ཆེས་བཟང་ངོ་ཞེས་ཟེར་རོ།
en: We have a much better color than you!’

source: །དེ་བཞིན་དུ་སེམས་ཅན་ཇི་སྙེད་ཅིག་ལུས་ཀྱི་དབྱིབས་ལེགས་པ་དང་ལྡན་པར་གྱུར་པ་དེ་དག་ཀྱང་། སེམས་ཅན་ལུས་ཀྱི་དབྱིབས་མི་སྡུག་པར་འགྱུར་བ་རྣམས་ལ་རློམ་ཞིང་ཁྱད་དུ་གསོད་དོ།
en: “In the same way, those beings who had an excellent body shape were dismissive and arrogant toward those beings who had ugly body shapes.

source: །དེ་དག་དེ་ལྟར་གཅིག་ལ་གཅིག་ཁྱད་དུ་གསོད་པ་ལས་བྱུང་བའི་མི་དགེ་བའི་རྩ་བས་ཚེའི་ཚད་ལས་ཀྱང་ཡོངས་སུ་བྲི་བར་གྱུར་ཏོ།
en: In that way, they did not care about each other, so that through the roots of demerit, their lifespans diminished.

source: །།ཁ་དོག་དང་སྟོབས་དང་བདེ་བ་ལས་ཀྱང་ཡོངས་སུ་བྲི་བར་གྱུར་ཏོ།
en: Even their color, strength, and happiness diminished.

source: །རྒྱལ་པོའི་ཕོ་བྲང་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མ་དེའི་བྱང་ཕྱོགས་ལོགས་ན། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ཤིང་ཀུན་ཏུ་གྲགས་པའི་ཆོས་ཀྱི་སྤྲིན་སྒྲའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་སྐད་ཅིག་རེ་རེ་ལ་ཡོངས་སུ་སྟོན་པ།
en: “To the north of the royal capital Ratna­kusuma­pradīpā there was the bodhimaṇḍa tree called Samantāvabhāsana­dharma­megha­nirghoṣa­dhvaja that manifested in each instant the display of the bodhimaṇḍas of all tathāgatas.

source: རྩ་བ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྡོ་རྗེ་ལྟར་སྲ་ཞིང་མི་འཇིག་པ།
en: Its roots were as hard and indestructible as diamond, the king of jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་གྲུབ་པས་ལྷུན་ཤིན་ཏུ་ཡངས་ཤིང་རྒྱས་པ།
en: Its bulk was made from all precious jewels and was vast and huge.

source: སྡོང་པོ་དང་ཡལ་ག་དང་ལོ་མ་དང་། མདབ་མ་དང་མེ་ཏོག་དང་། འབྲས་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱུ་ལས་གྲུབ་པ།
en: Its trunk, branches, leaves, flowers, and fruit were made from all jewels.

source: ཀུན་ཏུ་ཆ་མཉམ་པར་བཀོད་ཅིང་།
en: It was perfectly symmetrical.

source: ཀུན་ཏུ་ཁྱབ་པའི་ཡན་ལག་དང་ལྡན་པ།
en: It had branches that spread everywhere.

source: རྒྱན་ཀུན་ཏུ་རྒྱས་པར་འགེངས་ཤིང་མི་ཟད་པ་དང་ལྡན་པ།
en: It was a spreading, unceasing display.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་འཕྲོ་དང་། འོད་གཟེར་ཀུན་ཏུ་སྣང་བ་འགྱེད་པ།
en: It shone with the lights of various jewels, its light rays shining everywhere.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་རྣམ་པར་འཕྲུལ་པའི་དབྱངས་རྗེས་སུ་སྒྲོག་པ་ཡོད་དེ།
en: It resounded with descriptions of the miraculous manifestations that were the scope of all the tathāgatas.

source: སྙིང་པོ་བྱང་ཆུབ་དེའི་མདུན་རོལ་ན། སྤོས་ཆུའི་མཚོ་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། གློག་དང་ཆོས་ཀྱི་འབྲུག་སྒྲའི་སྤྲིན་གྱི་དབྱངས་ཤེས་བྱ་བ་ཡོད་དེ།
en: “In front of that bodhimaṇḍa there was a lake of scented water called Ratna­kusuma­vidyuddharma­nigarjita­megha­ghoṣa.

source: དེ་ནི་རིན་པོ་ཆེའི་ཤིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་བསྐོར་བ་སྟེ།
en: It was encircled by a quintillion precious trees, and all those precious trees had the same form as the Bodhi tree.

source: རིན་པོ་ཆེའི་ཤིང་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཤིང་གི་དབྱིབས་སུ་འཁོད་པ་ཤ་སྟག་གོ །སྤོས་ཆུའི་མཚོ་ཆེན་པོ་རིན་པོ་ཆེའི་མེ་ཏོག་དང་། གློག་དང་ཆོས་ཀྱི་འབྲུག་སྒྲའི་སྤྲིན་གྱི་དབྱངས་ཞེས་བྱ་བ་དེའི་འགྲམ་ཐམས་ཅད་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་བཀྲམ་ཞིང་རྣམ་པར་བཀོད་པ་སྟེ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཕྲེང་བ་སྣ་ཚོགས་སུ་དགྲིགས་པའོ། །རིན་པོ་ཆེ་རྣམ་པར་དག་པ་ལས་བྱས་པའི་ཁང་པ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱིས་ཡོངས་སུ་བརྒྱན་པའོ། །རྒྱན་རྣམ་པར་དག་པ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པའོ། །སྙིང་པོ་བྱང་ཆུབ་དེའི་འཁོར་ཐམས་ཅད་ཀྱང་ནོར་བུ་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ། པདྨའི་སྙིང་པོ་ཅན་ཤ་སྟག་གིས་ཡོངས་སུ་འཁོར་བ་སྟེ།
en: “All the banks of that great lake of scented water called Ratna­kusuma­vidyuddharma­nigarjita­megha­ghoṣa were covered with a splendid array of all precious jewels, decorated by various strings of all jewels, adorned by an array of mansions made of pure jewels, and beautified by an array of all pure adornments.

source: སྤོས་ཆུའི་མཚོ་ཆེན་པོ་རིན་པོ་ཆེའི་མེ་ཏོག་དང་གློག་དང་ཆོས་ཀྱི་འབྲུག་སྒྲའི་སྤྲིན་གྱི་དབྱངས་ཞེས་བྱ་བ་དེའི་དབུས་ནས།
en: “All around the bodhimaṇḍa were countless kūṭāgāras made of precious jewels, with lotuses in their centers.

source: པདྨོའི་རྒྱལ་པོ་ཆེན་པོ་ལོ་མའི་མཚམས་ནས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་རྣམ་པར་སྟོན་པའི་འོད་གཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་ཅེས་བྱ་བ་བྱུང་བར་གྱུར་ཏེ།
en: “In the center of the great lake of scented water called Ratna­kusuma­vidyuddharma­nigarjita­megha­ghoṣa there was a great king of lotuses called Sarva­tryadhva­tathāgata­viṣaya­patra­saṃdhi­vidyotita­megha­vyūha.

source: པདྨོ་ཆེན་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དེ་དག་གི་ནང་ནས་བསྐལ་པའི་ཐོག་མ་པ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏེ།
en: On that great lotus appeared a tathāgata named Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja, who was the very first from among tathāgatas as numerous as the atoms in Sumeru

source: དེ་ནི་བསྐལ་པ་དེ་ལ་ཐམས་ཅད་ཀྱི་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: He would be the first of all of them to attain the highest, complete enlightenment in that kalpa.

source: དེས་ལོ་སྟོང་ཕྲག་དུ་མ་ཞིག་དུ་ཆོས་བསྟན་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་ནས། ལོ་སྟོང་ཕྲག་བཅུར་འོད་གཟེར་སྣང་བའི་རྣམ་པར་འཕྲུལ་པས་ཡོངས་སུ་སྨིན་པར་མཛད་དོ། །དེ་བཞིན་གཤེགས་པ་དེ་ལོ་སྟོང་ཕྲག་བཅུ་ན་འབྱུང་བར་འགྱུར་རོ། །ཞེས་བྱ་བའི་ཚེ་པདྨའི་རྒྱལ་པོ་ཆེན་པོ་ལོ་མའི་མཚམས་ནས།
en: Having ripened beings by teaching the Dharma for many thousands of years, he was ripening beings for ten thousand years through the miraculous manifestation of the radiance of light rays, and then after ten thousand years that tathāgata would appear there.

source: དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་རྣམ་པར་སྟོན་པའི་འོད་གཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་ཅེས་བྱ་བ་དེ་ལས་སེམས་ཅན་ཐམས་ཅད་རྡུལ་དང་འབྱེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་འོད་ཟེར་བྱུང་བར་གྱུར་ཏེ།
en: “At that time, the great king of lotuses, Sarva­tryadhva­tathāgata­viṣaya­patra­saṃdhi­vidyotita­megha­vyūha, radiated a ray of light called Sarva­sattva­virajaḥpradīpa.

source: འོད་དེས་ཕོག་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་ལོ་སྟོང་ཕྲག་བཅུ་ན་དེ་བཞིན་གཤེགས་པ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བར་ཤེས་སོ།
en: The beings who were touched by that ray of light knew that in ten thousand years a tathāgata would come.

source: །ལོ་སྟོང་ཕྲག་དགུ་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་དེ་ལས་རྡུལ་དང་བྲལ་བའི་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བའི་འོད་གཟེར་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in nine thousand years, the Bodhi tree shined a ray of light called Virajovatī­śrī­garbhā.

source: འོད་གཟེར་དེས་ཕོག་པའི་སེམས་ཅན་དེ་དག་གིས་ཀྱང་གཟུགས་ཐམས་ཅད་ཤིན་ཏུ་ཕྲ་བར་མཐོང་བར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light saw all subtle forms.

source: །ལོ་སྟོང་ཕྲག་བརྒྱད་ན་དེ་བཞིན་གཤེགས་པ་འབྱུང་ངོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་ཟེར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྣམ་པར་སྨིན་པའི་དབྱངས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in eight thousand years, the great Bodhi tree shined a ray of light called Sarva­sattva­karma­vipāka­nirghoṣa.

source: དེས་ཕོག་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་རང་རང་གི་ལས་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་གྱུར་ཏེ། ལས་དྲན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light comprehended the ocean of their own karma and attained the wisdom that remembers karma.

source: །ལོ་སྟོང་ཕྲག་བདུན་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་དེ་ཉིད་ལས་འོད་གཟེར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བའི་དབྱངས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in seven thousand years, the great Bodhi tree shined a ray of light called Sarva­kuśala­mūla­saṃbhava­nirghoṣā.

source: འོད་གཟེར་དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་དབང་པོ་ཉམས་པ་མེད་ཅིང་ཡོངས་སུ་ཚང་བར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light gained unimpaired complete faculties.

source: །ལོ་སྟོང་ཕྲག་དྲུག་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་གཟེར་སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱངས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in six thousand years, the great Bodhi tree shined a ray of light called Acintya­buddha­viṣaya­nidarśana­nirghoṣā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རྣམ་པར་འཕྲུལ་བར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light made emanations with a vast motivation.

source: །ལོ་སྟོང་ཕྲག་ལྡན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་གཟེར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་སྒྲ་འབྱིན་བའི་གཟུགས་བརྙན་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in five thousand years, the great Bodhi tree shined a ray of light called Sarva­buddha­kṣetra­pariśuddhi­nigarjita­pratibhāsa­vijñāpanā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་དག་པར་མཐོང་བར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light saw with complete purity all buddha realms.

source: །ལོ་སྟོང་ཕྲག་བཞིན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་གཟེར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ཐ་མི་དད་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in four thousand years, the great Bodhi tree shined a ray of light called Sarva­tathāgata­viṣayāsaṃbheda­pradīpā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་དུ་སོང་བ་ལ་ཞུགས་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light comprehended the all-pervading miraculous manifestations of the tathāgatas.

source: །ལོ་སྟོང་ཕྲག་གསུམ་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ལས་འོད་ཟེར་འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in three thousand years, the great Bodhi tree shined a ray of light called Sarva­jagad­abhimukha­pradīpā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ཡང་མངོན་དུ་མོས་པས་མཐོང་བར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light directly saw, through their aspiration, the tathāgatas.

source: །ལོ་སྟོང་ཕྲག་གཉིས་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ལས་འོད་གཟེར་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་ཚུལ་རབ་ཏུ་སྒྲོག་པ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in two thousand years, the great Bodhi tree shined a ray of light called Tryadhva­jñāna­vidyut­pradīpā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་རེག་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་སྔོན་གྱི་ཚུལ་རྒྱ་མཚོ་ལ་རྟོག་ཅིང་འཇུག་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light realized and comprehended the ocean of the past ways of the tathāgatas.

source: །ལོ་སྟོང་ན་དེ་བཞིན་གཤེགས་པ་དེ་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ལས་འོད་གཟེར་ཡེ་ཤེས་རབ་རིབ་མེད་པ།
en: “At the time when the tathāgata would come in a thousand years, the great Bodhi tree shined a ray of light called Vitimira­jñāna­tathāgata­pradīpā.

source: དེ་བཞིན་གཤེགས་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་བྱུང་སྟེ། དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། ཞིང་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་མཐོང་བར་འགྱུར་བའི་མིག་ཀུན་ཏུ་ལྟ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light attained the all-seeing view of the vision that sees all the manifestations of the tathāgatas, all realms, and all beings.

source: །དེ་བཞིན་གཤེགས་པ་དེ་ལོ་བརྒྱ་ན་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་ཟེར་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་མཐོང་བ་རྣམ་པར་སྨིན་པའི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in a hundred years, the great Bodhi tree shined a ray of light called Sarva­jagad­buddha­darśana­vipāka­kuśala­mūla­saṃbhavā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས། དེ་བཞིན་གཤེགས་པ་སྐྱེ་བའི་འདུ་ཤེས་ཐོབ་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light attained the perception of the arising of the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་དེ་ཞག་བདུན་ན་སྐྱེ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་དེ་ཉིད་ལས་འོད་ཟེར་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བ་དང་། སྤྲོ་བ་དང་མོས་པ་ཡོངས་སུ་འབྱུང་བའི་དབྱངས་ཤེས་བྱ་བ་བྱུང་སྟེ།
en: “At the time when the tathāgata would come in seven days, the great Bodhi tree shined a ray of light called Sarva­sattva­praharṣa­prīti­prāmodya­samudaya­nirghoṣā.

source: དེས་སེམས་ཅན་དེ་དག་ལ་ཕོག་ནས་སངས་རྒྱས་མཐོང་བར་འགྱུར་བའི་དགའ་བའི་ཤུགས་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ།
en: The beings who were touched by that ray of light developed the great power of the joy of seeing the tathāgatas.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་འོད་ཟེར་གྱིས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཚུལ་ཚད་མེད་པ་རྣམ་པ་དེ་ལྟ་བུས་ལོ་སྟོང་དུ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨྱིན་པར་མཛད་ནས་ཞག་བདུན་པ་ལ་ཐུག་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་པའི་ཚུལ་ཚད་མེད་པས་ཡོངས་སུ་བསྐྱོད་ནས་ཤིན་ཏུ་དག་པར་བྱིན་གྱིས་བརླབས་སོ།
en: “Noble one, he ripened beings through that kind of immeasurable method of ripening through light rays for a thousand years. Then, on reaching the seventh day, he blessed the entire world realm as completely pure by shaking it through an immeasurable method for shaking it.

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དགེ་པ་ཇི་སྙེད་པ་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡོངས་སུ་བསྟན་པར་གྱུར་ཏོ།
en: In each instant of mind, all the pure buddha realms of all the tathāgatas in the ten directions with their various inconceivable displays appeared in that buddha realm.

source: །དེ་ནས་ཞག་བདུན་པ་ཐ་མ་ལ་བབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སེམས་ཅན་སངས་རྒྱས་མཐོང་བར་འགྱུར་བ་ཡོངས་སུ་སྨིན་པ་དེ་དག་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཏུ་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ།
en: “On the last, seventh, day, the beings in that world realm had been ripened by the sight of the buddhas, and they all came to face the bodhimaṇḍa.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཁོར་ཡུག་ཐམས་ཅད་དང་། རི་རབ་ཐམས་ཅད་དང་། རི་ཐམས་ཅད་དང་། ཆུ་ཀླུང་ཐམས་ཅད་དང་། རྒྱ་མཚོ་ཐམས་ཅད་དང་ཤིང་ཐམས་ཅད་དང་། སའི་གཞི་ཐམས་ཅད་དང་། གྲོང་ཁྱེར་ཐམས་ཅད་དང་། ར་བ་ཐམས་ཅད་དང་། གནས་ཐམས་ཅད་དང་། གཞལ་མེད་ཁང་ཐམས་ཅད་དང་། གོས་དང་རྒྱན་དང་ལོངས་སྤྱོད་ཐམས་ཅད་དང་། རོལ་མོའི་ཤིང་ཐམས་ཅད་དང་། རོལ་མོ་བརྡུང་བའི་དབྱངས་ཐམས་ཅད་དང་། སྤྲུལ་པའི་རྒྱན་ཐམས་ཅད་ཀྱི་དམིགས་པ་རེ་རེ་ལས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་དང་། མཐུའི་སྒྲ་རབ་ཏུ་སྒྲོག་པའི་སྤོས་དང་། བདུག་སྤོས་ཐམས་ཅད་ཀྱི་སྤྲིན་མངོན་པར་འཐོན་ཏེ།
en: “Then, from all that world realm’s Cakravāla mountains, from all the Sumeru mountains, from all mountains, from all rivers, from all oceans, from all trees, from all the surface of the ground, from all towns, from all walls, from all dwellings, from all aerial palaces, from all clothes, jewelry, and enjoyments, from all musical trees, from all sounds of musical instruments, from all emanated displays, from each perceived thing, there came the description of the range of activity and the power of all tathāgatas, and there issued forth clouds of all incenses and perfumes; clouds of lights shining from jewels; clouds of lights shining from all perfumes and incenses;

source: རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་སྤྲིན་དང་། སྤོས་དང་བདུག་སྤོས་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་དམ་པ་དང་། སྤོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་སྤྲིན་དང་། གོས་རིན་པོ་ཆེ་དང་། རྒྱན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་རི་རབ་ཀྱི་སྤྲིན་དང་ཕྱེ་མ་སྣ་ཚོགས་ཀྱི་སྤྲིན་མང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་གཟེར་གྱི་སྤྲིན་རྣམ་པར་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་རབ་ཏུ་འགྱེད་པ།
en: clouds in the form of all perfume and jewels; clouds of all clothing, jewels, and precious jewelry; clouds of Sumerus of various precious flowers; many clouds of various powders; and clouds of the light rays of all the tathāgatas. The Cakravāla mountains and so forth emitted clouds of the halos of light of all the tathāgatas.

source: རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་ཐམས་ཅད་ཀྱི་སྤྲིན་ཡོངས་སུ་འཁྲོལ་ཞིང་རྡུང་བ།
en: They resounded with clouds of the music of all instruments and drums.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་སྒྲ་སྐད་ཀྱི་སྤྲིན་རབ་ཏུ་འབྱིན་པ།
en: They emitted clouds of the sound of the prayers of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་། གསུང་རྒྱ་མཚོའི་སྤྲིན་རབ་ཏུ་སྒྲོག་པ།
en: They resounded with clouds of the aspects of voice and the oceans of speech of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་གཟུགས་བརྙན་སྣ་ཚོགས་ཀྱི་སྤྲིན་རབ་ཏུ་སྟོན་པར་བྱེད་ཅིང་།
en: They manifested clouds of various images of the signs and features of a great being possessed by all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་འབྱུང་བའི་ལྟས་སྔོན་དུ་བྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་སྟོན་ཏེ། རིན་པོ་ཆེའི་རྒྱལ་པོའི་པདྨོ་ཆེན་པོའི་ལོ་མའི་མཚམས་ནས།
en: They revealed countless omens of the coming of a tathāgata.

source: དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་རྣམ་པར་སྟོན་པའི་འོད་གཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་དེའི་པདྨོའི་འཁོར་རིན་པོ་ཆེའི་རྒྱལ་པོ་ལས་བྱས་པ་ཆེན་པོ་ཤ་སྟག་ཏུ་བྱས་ཏེ་འཁོད་དོ།
en: “The lotus Sarva­tryadhva­tathāgata­viṣaya­patra­saṃdhi­vidyotita­megha­vyūha had a retinue of great lotuses that were all made of the kings of jewels.

source: །རིན་པོ་ཆེའི་རྒྱལ་པོའིཔདྨོ་ཆེན་པོའི་འཁོར་ཀྱི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོ་དེ་དག་གི་ཟེ་བ་དང་། སྙིང་པོ་ལ་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པདྨོ་ཆེན་པོའི་སྙིང་པོ་ཅན།
en: On the filaments and pericarps of the great lotuses that were the retinue of the great lotus made of the kings of jewels, there were precious lion thrones with great lotuses in their centers.

source: སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་བྱུང་བར་གྱུར་ཏེ།
en: They were as numerous as the atoms in ten buddha realms.

source: རིན་པོ་ཆེའི་སྙིང་པོ་ཅན་གྱི་ཁྲི་དེ་དག་ལའང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་པར་གྱུར་ཏོ།
en: As many bodhisattvas as there are atoms in ten buddha realms were seated cross-legged around those thrones with a precious center.

source: །བཅོམ་ལྡན་འདས་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་མ་ཐག་ཏུ་དེའི་མོད་ལ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དེ་བཞིན་གཤེགས་པ་མང་པོ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གྱུར་ཏོ།
en: “The moment that tathāgata, the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja, attained the highest, complete enlightenment of buddhahood, many tathāgatas in world realms in the ten directions also attained the highest, complete enlightenment of buddhahood and, in accordance with the dispositions of beings, turned the wheel of the Dharma.

source: །དེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ངན་སོང་དང་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་གོ །སེམས་ཅན་ཚད་མེད་པ་ནི་མཐོ་རིས་སུ་སྐྱེ་བ་ལ་རབ་ཏུ་བཀོད་དོ།
en: “The countless beings in those world realms were turned away from all lower realms and downfalls. Countless beings were brought to rebirth in the higher realms.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཉན་ཐོས་ཀྱི་ས་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established on the level of the śrāvakas.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Countless beings were ripened for the enlightenment of the pratyeka­buddhas.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཤུགས་དྲག་པོའི་འོད་ཀྱིས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Countless beings were ripened for the enlightenment that arises in the light of power.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བརྩོན་འགྲུས་དྲི་མ་མེད་པའི་རྒྱལ་མཚན་གྱི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Countless beings were ripened for enlightenment in the banner of stainless diligence.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཆོས་རབ་ཏུ་བསྒོམ་པའི་གནས་སུ་བྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the enlightenment that arises in dwelling in meditation on the Dharma.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་དབང་པོ་ཡོངས་སུ་དག་པ་རབ་ཏུ་བསྒོམས་པས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Countless beings were ripened for the enlightenment that arises in meditation on the purification of the faculties.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་སྟོབས་མཉམ་པ་ཉིད་ལ་ཡང་དག་པར་སྤྱོད་པ་ཁོང་དུ་ཆུད་པས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: Countless beings were ripened for the enlightenment that arises in comprehending the practice of the equanimity of strength.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཆོས་ཀྱི་གྲོང་ཁྱེར་མངོན་དུ་འགྱུར་བའི་ཡུལ་གྱི་ཐེག་བ་སྐྱེ་པས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the enlightenment that arises in the emergence of the yāna with its field of attention turned toward the city of the Dharma.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བའི་རྫུ་འཕྲུལ་ཐ་མི་དད་པའི་ཚུལ་གྱི་ཐེག་པས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the enlightenment that arises in the yāna of the ways of various miraculous manifestations that pervade everywhere.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་སྤྱོད་པའི་སྦྱོར་བ་ལ་ཡང་དག་པར་གཞོལ་བའི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the enlightenment that arises in the way of being dedicated to practice.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཏིང་ངེ་འཛིན་གྱིས་འཇུག་པའི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །སེམས་ཅན་ཚད་མེད་པ་ནི་དམིགས་པའི་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་དག་པའི་དཀྱིལ་འཁོར་གྱི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the enlightenment that arises in the ways of entering samādhi.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Countless beings developed the aspiration for the enlightenment of the bodhisattvas.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established on the bodhisattva path.
